[
    {
        "Muscles": "Abs",
        "WorkOut": "Plank",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Maintain a push-up position, keeping your body straight and holding the position to engage your entire core.",
        "Long Explanation": "The Plank is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Plank"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Crunches",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Lie on your back, knees bent, lift your shoulders off the floor using your core muscles.",
        "Long Explanation": "The Crunches is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Crunches"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Bicycle Crunches",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Lie on your back, alternate bringing your elbow to the opposite knee, mimicking a cycling motion.",
        "Long Explanation": "The Bicycle Crunches is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Bicycle+Crunches"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Russian Twists",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Pull-up bar or sturdy bar",
        "Explaination": "Sit on the floor, lean back slightly, and twist your torso from side to side with or without a weight.",
        "Long Explanation": "The Russian Twists is a weight training exercise targeting the Abs. It involves using Pull-up bar or sturdy bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Russian+Twists"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Hanging Leg Raises",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Hang from a pull-up bar and raise your legs to hip level, keeping them straight or bending knees.",
        "Long Explanation": "The Hanging Leg Raises is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Hanging+Leg+Raises"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Mountain Climbers",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Start in a plank position, then alternate bringing your knees towards your chest rapidly.",
        "Long Explanation": "The Mountain Climbers is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Mountain+Climbers"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Reverse Crunches",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Lie on your back and lift your hips off the ground, bringing your knees towards your chest.",
        "Long Explanation": "The Reverse Crunches is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Reverse+Crunches"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Leg Raises",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Ab roller",
        "Explaination": "Lie on your back, keep your legs straight, and lift them up towards the ceiling, then lower them without touching the floor.",
        "Long Explanation": "The Leg Raises is a weight training exercise targeting the Abs. It involves using Ab roller, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Leg+Raises"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "V-Ups",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Lie on your back, simultaneously lift your legs and torso, reaching for your toes.",
        "Long Explanation": "The V-Ups is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=V-Ups"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Ab Roller",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Use an ab roller to roll forward from your knees or toes, then roll back, engaging your core.",
        "Long Explanation": "The Ab Roller is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Ab+Roller"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Toe Touches",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Cable machine with rope or handle attachment",
        "Explaination": "Lie on your back with legs extended upward, reach towards your toes with your hands.",
        "Long Explanation": "The Toe Touches is a weight training exercise targeting the Abs. It involves using Cable machine with rope or handle attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Toe+Touches"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Flutter Kicks",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Lie on your back, lift your legs slightly off the ground, and make small, quick up-and-down scissor-like motions.",
        "Long Explanation": "The Flutter Kicks is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Flutter+Kicks"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Cable Woodchoppers",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Use a cable machine, stand and twist your torso, pulling the cable diagonally across your body.",
        "Long Explanation": "The Cable Woodchoppers is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Cable+Woodchoppers"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Plank Jacks",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Start in a plank position, jump your feet in and out like a jumping jack.",
        "Long Explanation": "The Plank Jacks is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Plank+Jacks"
    },
    {
        "Muscles": "Abs",
        "WorkOut": "Side Plank",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Lie on your side, lift your body so that you are supported by your forearm and feet, hold the position to work the obliques.",
        "Long Explanation": "The Side Plank is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Side+Plank"
    }
]