[
    {
        "Muscles": "Back",
        "WorkOut": "Deadlift",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell",
        "Explaination": "Deadlift: Lift a barbell or weights from the ground to hip level, keeping your back straight and driving with your legs.",
        "Long Explanation": "The Deadlift is a weight training exercise targeting the Back. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Deadlift"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Pull-Ups",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Pull-up bar",
        "Explaination": "Pull-Ups: Grip a bar with palms facing away and pull your body up until your chin is over the bar.",
        "Long Explanation": "The Pull-Ups is a weight training exercise targeting the Back. It involves using Pull-up bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Pull-Ups"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Bent-Over Barbell Row",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell",
        "Explaination": "Bent-Over Barbell Row: Bend at the waist, hold a barbell with both hands and pull it towards your lower chest or abdomen.",
        "Long Explanation": "The Bent-Over Barbell Row is a weight training exercise targeting the Back. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Bent-Over+Barbell+Row"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Lat Pulldown",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Cable machine with lat pulldown bar",
        "Explaination": "Lat Pulldown: Sit at a lat pulldown machine, pull the bar down towards your chest while keeping your back straight.",
        "Long Explanation": "The Lat Pulldown is a weight training exercise targeting the Back. It involves using Cable machine with lat pulldown bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Lat+Pulldown"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Seated Cable Row",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Cable machine",
        "Explaination": "Seated Cable Row: Sit at a cable row station, pull the handle towards your waist while keeping your back straight.",
        "Long Explanation": "The Seated Cable Row is a weight training exercise targeting the Back. It involves using Cable machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Seated+Cable+Row"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Single-Arm Dumbbell Row",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbell",
        "Explaination": "Single-Arm Dumbbell Row: Bend over at the waist, use one hand to row a dumbbell, keeping your back parallel to the floor.",
        "Long Explanation": "The Single-Arm Dumbbell Row is a weight training exercise targeting the Back. It involves using Dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Single-Arm+Dumbbell+Row"
    },
    {
        "Muscles": "Back",
        "WorkOut": "T-Bar Row",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell and T-bar row machine or landmine attachment",
        "Explaination": "T-Bar Row: Straddle a barbell, lift it using a T-bar attachment or handle, keeping your back straight.",
        "Long Explanation": "The T-Bar Row is a weight training exercise targeting the Back. It involves using Barbell and T-bar row machine or landmine attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=T-Bar+Row"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Inverted Row",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Bar or Smith machine",
        "Explaination": "Inverted Row: Lie under a bar, pull your chest up to the bar with feet planted on the ground.",
        "Long Explanation": "The Inverted Row is a weight training exercise targeting the Back. It involves using Bar or Smith machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Inverted+Row"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Back Extension",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Back extension bench",
        "Explaination": "Back Extension: Use a back extension bench to lift your upper body up and down, focusing on lower back muscles.",
        "Long Explanation": "The Back Extension is a weight training exercise targeting the Back. It involves using Back extension bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Back+Extension"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Machine Row",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Rowing machine",
        "Explaination": "Machine Row: Sit at a row machine, pull the handles towards your torso, focusing on your middle back.",
        "Long Explanation": "The Machine Row is a weight training exercise targeting the Back. It involves using Rowing machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Machine+Row"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Chin-Up",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Pull-up bar",
        "Explaination": "Chin-Up: Grip a bar with palms facing towards you and pull up until your chin is over the bar, focusing on your upper back.",
        "Long Explanation": "The Chin-Up is a weight training exercise targeting the Back. It involves using Pull-up bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Chin-Up"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Renegade Row",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbells",
        "Explaination": "Renegade Row: In a plank position with dumbbells, row one dumbbell up while stabilizing your body with the other arm.",
        "Long Explanation": "The Renegade Row is a weight training exercise targeting the Back. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Renegade+Row"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Resistance Band Pull Apart",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Resistance band",
        "Explaination": "Resistance Band Pull Apart: Hold a resistance band in front of you and pull it apart horizontally, focusing on your rear shoulders and upper back.",
        "Long Explanation": "The Resistance Band Pull Apart is a weight training exercise targeting the Back. It involves using Resistance band, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Resistance+Band+Pull+Apart"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Hyperextension",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Hyperextension bench",
        "Explaination": "Hyperextension: On a hyperextension bench, lift and lower your upper body, targeting your lower back.",
        "Long Explanation": "The Hyperextension is a weight training exercise targeting the Back. It involves using Hyperextension bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Hyperextension"
    },
    {
        "Muscles": "Back",
        "WorkOut": "Face Pull",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Cable machine with rope or handle attachment",
        "Explaination": "Face Pull: Use a cable machine with a rope attachment, pull towards your face while keeping your elbows high.",
        "Long Explanation": "The Face Pull is a weight training exercise targeting the Back. It involves using Cable machine with rope or handle attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Face+Pull"
    }
]