[
    {
        "Muscles": "Biceps",
        "WorkOut": "Barbell Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell",
        "Explaination": "Barbell Curl: Stand with feet shoulder-width apart, hold a barbell with an underhand grip and curl it towards your shoulders.",
        "Long Explanation": "This classic bicep-building exercise involves standing with feet shoulder-width apart, gripping a barbell with an underhand grip. With elbows close to the torso, curl the barbell towards the shoulders while keeping the upper arms stationary. This motion targets the bicep muscles, including both the long and short head, providing development in muscle mass and arm strength. The focus is on smooth, controlled movements, exhaling as you lift the barbell and inhaling on the return. For beginners, it's crucial to start with a lighter weight to perfect the form before progressing.",
        "Video": "https://www.youtube.com/results?search_query=Barbell+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Dumbbell Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbells",
        "Explaination": "Dumbbell Curl: Curl dumbbells alternately or simultaneously while keeping your elbows close to your torso.",
        "Long Explanation": "The Dumbbell Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Dumbbell+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Hammer Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbells",
        "Explaination": "Hammer Curl: Perform dumbbell curls with palms facing each other, targeting the brachialis muscle.",
        "Long Explanation": "The Hammer Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Hammer+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Preacher Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Preacher bench and barbell or dumbbell",
        "Explaination": "Preacher Curl: Use a preacher bench to isolate biceps, keeping the upper arms stationary.",
        "Long Explanation": "The Preacher Curl is a weight training exercise targeting the Biceps. It involves using Preacher bench and barbell or dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Preacher+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Concentration Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbell",
        "Explaination": "Concentration Curl: Sit with a dumbbell in one hand, elbow on the thigh, and curl the weight focusing on the bicep.",
        "Long Explanation": "The Concentration Curl is a weight training exercise targeting the Biceps. It involves using Dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Concentration+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Cable Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Cable machine with bar attachment",
        "Explaination": "Cable Curl: Use a cable machine with a bar attachment, curling the bar towards your chest.",
        "Long Explanation": "The Cable Curl is a weight training exercise targeting the Biceps. It involves using Cable machine with bar attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Cable+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "EZ-Bar Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "EZ-bar",
        "Explaination": "EZ-Bar Curl: Curl an EZ-bar with both hands, which can be easier on your wrists.",
        "Long Explanation": "The EZ-Bar Curl is a weight training exercise targeting the Biceps. It involves using EZ-bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=EZ-Bar+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Incline Dumbbell Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbells and an incline bench",
        "Explaination": "Incline Dumbbell Curl: Lie back on an incline bench, curl dumbbells with arms hanging down.",
        "Long Explanation": "The Incline Dumbbell Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells and an incline bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Incline+Dumbbell+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Reverse Barbell Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell",
        "Explaination": "Reverse Barbell Curl: Grip the barbell overhand and curl, targeting the forearms and biceps.",
        "Long Explanation": "The Reverse Barbell Curl is a weight training exercise targeting the Biceps. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Reverse+Barbell+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Seated Alternating Dumbbell Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbells and a bench",
        "Explaination": "Seated Alternating Dumbbell Curl: Alternate curling dumbbells while seated, focusing on each bicep.",
        "Long Explanation": "The Seated Alternating Dumbbell Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells and a bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Seated+Alternating+Dumbbell+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Zottman Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbells",
        "Explaination": "Zottman Curl: Curl dumbbells up normally and rotate your wrists at the top to descend with an overhand grip.",
        "Long Explanation": "The Zottman Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Zottman+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Resistance Band Bicep Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Resistance band",
        "Explaination": "Resistance Band Bicep Curl: Stand on a resistance band and curl your hands towards your shoulders.",
        "Long Explanation": "The Resistance Band Bicep Curl is a weight training exercise targeting the Biceps. It involves using Resistance band, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Resistance+Band+Bicep+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Chin-Up",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Pull-up bar",
        "Explaination": "Chin-Up: Grip a bar with palms facing you and pull yourself up, focusing on biceps.",
        "Long Explanation": "The Chin-Up is a weight training exercise targeting the Biceps. It involves using Pull-up bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Chin-Up"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Machine Bicep Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Bicep curl machine",
        "Explaination": "Machine Bicep Curl: Use a bicep curl machine, focusing on isolating the bicep muscle.",
        "Long Explanation": "The Machine Bicep Curl is a weight training exercise targeting the Biceps. It involves using Bicep curl machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Machine+Bicep+Curl"
    },
    {
        "Muscles": "Biceps",
        "WorkOut": "Spider Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Bench (preferably inclined) and barbell or dumbbells",
        "Explaination": "Spider Curl: Lie face down on an incline bench and curl barbells, isolating biceps.",
        "Long Explanation": "The Spider Curl is a weight training exercise targeting the Biceps. It involves using Bench (preferably inclined) and barbell or dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Spider+Curl"
    }
]