[
    {
        "Muscles": "Chest",
        "WorkOut": "Bench Press",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell and bench",
        "Explaination": "Bench Press: Lie on a bench, press a barbell up from your chest, then lower it back down.",
        "Long Explanation": "The Bench Press is a weight training exercise targeting the Chest. It involves using Barbell and bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Bench+Press"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Push-Ups",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Push-Ups: Keep your body straight and lower it to the ground by bending your arms, then push back up.",
        "Long Explanation": "The Push-Ups is a weight training exercise targeting the Chest. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Push-Ups"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Incline Bench Press",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell and incline bench",
        "Explaination": "Incline Bench Press: Perform a bench press on an inclined bench to target the upper chest.",
        "Long Explanation": "The Incline Bench Press is a weight training exercise targeting the Chest. It involves using Barbell and incline bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Incline+Bench+Press"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Decline Bench Press",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell and decline bench",
        "Explaination": "Decline Bench Press: Use a decline bench for bench pressing, focusing on the lower chest.",
        "Long Explanation": "The Decline Bench Press is a weight training exercise targeting the Chest. It involves using Barbell and decline bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Decline+Bench+Press"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Dumbbell Flyes",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbells and a bench",
        "Explaination": "Dumbbell Flyes: Lie on a bench, extend arms with dumbbells, and bring them together in an arc motion.",
        "Long Explanation": "The Dumbbell Flyes is a weight training exercise targeting the Chest. It involves using Dumbbells and a bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Dumbbell+Flyes"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Cable Crossovers",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Cable machine with pulley system",
        "Explaination": "Cable Crossovers: Stand between two cable stations, pull handles together in front of you in a hugging motion.",
        "Long Explanation": "The Cable Crossovers is a weight training exercise targeting the Chest. It involves using Cable machine with pulley system, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Cable+Crossovers"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Chest Press Machine",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Chest press machine",
        "Explaination": "Chest Press Machine: Sit on the machine, push the bars or handles forward, then bring them back towards the chest.",
        "Long Explanation": "The Chest Press Machine is a weight training exercise targeting the Chest. It involves using Chest press machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Chest+Press+Machine"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Pec Deck Machine",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Pec deck machine",
        "Explaination": "Pec Deck Machine: Sit with arms on the pads and bring them together in front of you.",
        "Long Explanation": "The Pec Deck Machine is a weight training exercise targeting the Chest. It involves using Pec deck machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Pec+Deck+Machine"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Dips for Chest",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Parallel bars",
        "Explaination": "Dips for Chest: Perform dips with a forward lean to emphasize the chest muscles.",
        "Long Explanation": "The Dips for Chest is a weight training exercise targeting the Chest. It involves using Parallel bars, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Dips+for+Chest"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Svend Press",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Plates or dumbbells",
        "Explaination": "Svend Press: Hold plates between your hands and press them together in front of your chest, then push forward.",
        "Long Explanation": "The Svend Press is a weight training exercise targeting the Chest. It involves using Plates or dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Svend+Press"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Single-Arm Dumbbell Bench Press",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbell and bench",
        "Explaination": "Single-Arm Dumbbell Bench Press: Lie on a bench and press a dumbbell with one arm, alternating sides.",
        "Long Explanation": "The Single-Arm Dumbbell Bench Press is a weight training exercise targeting the Chest. It involves using Dumbbell and bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Single-Arm+Dumbbell+Bench+Press"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Floor Press",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell and bench",
        "Explaination": "Floor Press: Similar to a bench press but performed lying on the floor, limiting the range of motion.",
        "Long Explanation": "The Floor Press is a weight training exercise targeting the Chest. It involves using Barbell and bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Floor+Press"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Plyometric Push-Up",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Plyometric Push-Up: Explosive push-ups, where you push off the ground to lift your hands, then land back in a push-up.",
        "Long Explanation": "The Plyometric Push-Up is a weight training exercise targeting the Chest. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Plyometric+Push-Up"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Resistance Band Chest Press",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Resistance band",
        "Explaination": "Resistance Band Chest Press: Wrap a resistance band around your back and press forward as if bench pressing.",
        "Long Explanation": "The Resistance Band Chest Press is a weight training exercise targeting the Chest. It involves using Resistance band, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Resistance+Band+Chest+Press"
    },
    {
        "Muscles": "Chest",
        "WorkOut": "Staggered Push-Up",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Staggered Push-Up: Perform push-ups with one hand forward and the other back, alternating the position each rep.",
        "Long Explanation": "The Staggered Push-Up is a weight training exercise targeting the Chest. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Staggered+Push-Up"
    }
]