[
    {
        "Muscles": "Legs",
        "WorkOut": "Squat",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell or dumbbells",
        "Explaination": "Squat: Stand with feet shoulder-width apart, bend knees to lower your body as if sitting back, then stand up.",
        "Long Explanation": "The Squat is a weight training exercise targeting the Legs. It involves using Barbell or dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Squat"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Deadlift",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell",
        "Explaination": "Deadlift: Bend at your hips and knees to lower and grab a barbell, then stand up, lifting the weight.",
        "Long Explanation": "The Deadlift is a weight training exercise targeting the Legs. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Deadlift"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Lunges",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbells",
        "Explaination": "Lunges: Step forward with one foot and lower your body until both knees are bent at 90 degrees.",
        "Long Explanation": "The Lunges is a weight training exercise targeting the Legs. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Lunges"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Leg Press",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Leg press machine",
        "Explaination": "Leg Press: Sit in a leg press machine, push the weighted platform away, then return to the starting position.",
        "Long Explanation": "The Leg Press is a weight training exercise targeting the Legs. It involves using Leg press machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Leg+Press"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Bulgarian Split Squat",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbell and a bench or platform",
        "Explaination": "Bulgarian Split Squat: Perform a lunge with your rear foot elevated on a bench or platform.",
        "Long Explanation": "The Bulgarian Split Squat is a weight training exercise targeting the Legs. It involves using Dumbbell and a bench or platform, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Bulgarian+Split+Squat"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Step-Up",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Bench or platform",
        "Explaination": "Step-Up: Step up onto a bench or platform with one foot, then step back down and repeat with the other foot.",
        "Long Explanation": "The Step-Up is a weight training exercise targeting the Legs. It involves using Bench or platform, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Step-Up"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Calf Raises",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Calf Raises: Stand on the edge of a step or platform and raise and lower your heels, working the calf muscles.",
        "Long Explanation": "The Calf Raises is a weight training exercise targeting the Legs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Calf+Raises"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Romanian Deadlift",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell",
        "Explaination": "Romanian Deadlift: Hold a barbell or dumbbells, bend at your hips, and lower your torso, keeping your legs straight.",
        "Long Explanation": "The Romanian Deadlift is a weight training exercise targeting the Legs. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Romanian+Deadlift"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Leg Extension",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Leg extension machine",
        "Explaination": "Leg Extension: Sit on a leg extension machine and extend your legs against resistance, then return to the start.",
        "Long Explanation": "The Leg Extension is a weight training exercise targeting the Legs. It involves using Leg extension machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Leg+Extension"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Leg Curl",
        "Intensity_Level": "Beginner",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Leg curl machine",
        "Explaination": "Leg Curl: Lie or sit on a leg curl machine and curl your legs towards your buttocks against resistance.",
        "Long Explanation": "The Leg Curl is a weight training exercise targeting the Legs. It involves using Leg curl machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Leg+Curl"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Hack Squat",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Hack squat machine",
        "Explaination": "Hack Squat: Use a hack squat machine, squat down while keeping your back against the pad, then stand back up.",
        "Long Explanation": "The Hack Squat is a weight training exercise targeting the Legs. It involves using Hack squat machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Hack+Squat"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Goblet Squat",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Dumbbell or kettlebell",
        "Explaination": "Goblet Squat: Hold a kettlebell or dumbbell at your chest, squat down while keeping your back straight.",
        "Long Explanation": "The Goblet Squat is a weight training exercise targeting the Legs. It involves using Dumbbell or kettlebell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Goblet+Squat"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Box Jump",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Box or sturdy platform",
        "Explaination": "Box Jump: Stand in front of a box or platform and jump onto it with both feet, then step back down.",
        "Long Explanation": "The Box Jump is a weight training exercise targeting the Legs. It involves using Box or sturdy platform, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Box+Jump"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Glute Bridge",
        "Intensity_Level": "Expert",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "No Equipment Needed.",
        "Explaination": "Glute Bridge: Lie on your back with knees bent, lift your hips while squeezing your glutes, then lower back down.",
        "Long Explanation": "The Glute Bridge is a weight training exercise targeting the Legs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Glute+Bridge"
    },
    {
        "Muscles": "Legs",
        "WorkOut": "Stiff-Legged Deadlift",
        "Intensity_Level": "Intermediate",
        "Beginner Sets": "3 Sets with 12 to 15 reps",
        "Intermediate Sets": "4 Sets with 8 to 12 reps",
        "Expert Sets": "5 Sets with 3 to 10 reps",
        "Equipment": "Barbell",
        "Explaination": "Stiff-Legged Deadlift: Similar to the Romanian deadlift, but with legs kept rigid and straight throughout the movement.",
        "Long Explanation": "The Stiff-Legged Deadlift is a weight training exercise targeting the Legs. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
        "Video": "https://www.youtube.com/results?search_query=Stiff-Legged+Deadlift"
    }
]